[
  {
    "id": "01",
    "name": "The Ultimate HTML/CSS Mastery Course",
    "image": "https://i.ibb.co/cQszdmk/FA-cc-codemosh-nobadge.jpg",
    "title": "Everything you need to build fast and beautiful websites with HTML5 and CSS3 in one course",
    "price": 59,
    "rating": 4.7,
    "description": "Have you always wanted to learn web development but didn't know where to start? Tired of lengthy, boring and outdated courses? This course is for you. A fun, comprehensive and beginner-friendly course that teaches you all the skills you need to build professional-quality websites with HTML5 and CSS3. Say goodbye to long, boring, repetitive courses with outdated content that spend too much time on the basics. This is the only HTML5/CSS3 you'll ever need! The first part teaches you the fundamentals, the second part explores advanced concepts and the third part puts everything together to build and deploy a real website. You'll start with a Photoshop design mockup and finish with a live website. The first part teaches you the fundamentals, the second part explores advanced concepts and the third part puts everything together to build and deploy a real website. You'll start with a Photoshop design mockup and finish with a live website. Whether you're an absolute beginner wanting to learn web development from scratch, or you know a bit of HTML5/CSS3 and need a refresher course to fill the gaps, this course will help you achieve your goals. ",
    "features": [
      "Learn the fundamentals of web development",
      "Structure your web pages using HTML5",
      "Make beautiful web pages using CSS3",
      "Learn the essential Photoshop skills every web developer needs",
      "Master mobile-first responsive design",
      "Create layouts with Flex and Grid layout systems",
      "Add smooth, beautiful animations",
      "Create beautiful typography",
      "Optimize images for performance",
      "Build forms with data validation",
      "Write clean, maintainable, object-oriented CSS3",
      "Learn HTML5/CSS3 best practices",
      "Write valid, semantic HTML5 code that search engines love",
      "Increase your productivity using little-known shortcuts",
      "Host your code on GitHub",
      "Set up continuous deployment",
      "Measure your website's performance"
    ]
  },
  {
    "id": "02",
    "name": "The Ultimate JavaScript Course",
    "image": "https://i.ibb.co/dc0j1YL/js.png",
    "title": "Master JavaScript: Go from Beginner to Pro",
    "price": 90,
    "rating": 4.9,
    "description": "JavaScript is one of the most popular programming languages in the world. Companies like Walmart, Netflix, and PayPal run big internal applications around JavaScript. If you're looking for a career in web or mobile app development, you MUST know JavaScript well. The problem is: JavaScript is complicated and most books and courses fail to explain it properly, in simple words, the way most people can understand. That's why I've created this series for you. It breaks down modern JavaScript into digestible and easy-to-understand pieces using real-world examples, exercises and step-by-step solutions.",
    "features": [
      "Fundamentals of programming",
      "Variables and types",
      "Operators (arithmetic, comparison, logical, bitwise, etc)",
      "Conditional statements (if/else, switch/case)",
      "Loops (for, while, do-while)",
      "Error handling",
      "Arrays",
      "Functions",
      "Object-oriented programming",
      "Property descriptors",
      "Getters and setters",
      "Factory and constructor functions",
      "The 'this' pointer",
      "Prototypes and prototypical inheritance",
      "Modern JavaScript features frequently used in apps",
      "And much, much more!"
    ]
  },
  {
    "id": "03",
    "name": "Mastering React",
    "image": "https://i.ibb.co/D114W4Q/2-2.jpg",
    "title": "Understand React inside out and boost your career prospects",
    "price": 130,
    "rating": 5,
    "description": "What else do you expect from a JavaScript library that was developed by Facebook? But seriously, if you don't know how to build apps with React - then you're falling behind the curve. It has quickly become the most popular JavaScript library since its release in 2011. Both new and seasoned developers are using it to build app front-ends that are fast, dynamic and stand out. If you want to see what React apps are like, just think of the big popular sites like Facebook, Instagram, Netflix, Yahoo, the list goes on If you're tired of slow, repetitive and boring courses, I've got the perfect course for you Highly technical with a perfect mix of theory and practice. It covers absolutely every detail you could possibly need to take you from beginner React developer to an expert. I share tips from several years experience using React, including the do's and don'ts, best practices, common mistakes and practical shortcuts that every professional React developer needs to know.",
    "features": [
      "Modern JavaScript features",
      "Build reusable components",
      "Build tables and lists with pagination, sorting and searching",
      "Build forms with validation",
      "Implement routing with React Router",
      "Call HTTP services with Axios",
      "Implement authentication and authorization",
      "Handle and log errors effectively",
      "All about Function Components and Hooks",
      "Share data using React Context",
      "Deploy your React apps to Heroku",
      "Write clean, maintainable code like a pro",
      "Shortcuts to write more code in less time",
      "And much, much more!"
    ]
  },
  {
    "id": "04",
    "name": "The Ultimate Redux Course",
    "image": "https://i.ibb.co/bRhGYBZ/Redux.jpg",
    "title": "Go from beginner to expert in 6 hours. Everything you need to build modern apps with Redux.",
    "price": 95,
    "rating": 4.8,
    "description": "Redux is the most popular state management library for JavaScript apps. It's mostly used with React but it's also becoming popular in Angular, Ember and Vue communities. Despite being a small library with a small footprint, a lot of developers find Redux confusing and complicated. They also complain that Redux introduces a lot of boilerplate in the code and makes trivial things overly complicated. This course gives you a solid foundation on Redux and teaches you how to write clean and concise modern Redux code.",
    "features": [
      "What Redux is and when to use it",
      "Essential functional programming principles",
      "Use Redux Toolkit to kickstart Redux apps",
      "Debug apps using Redux DevTools",
      "Design a Redux store",
      "Write clean, concise, maintainable Redux code",
      "Properly structure Redux code",
      "Handle asynchronous events with redux-thunk",
      "Use existing middleware or write your own",
      "Test Redux code, the right way",
      "Connect React and Redux using react-redux",
      "The popular tools in Redux ecosystem",
      "Industry best practices and recommended patterns",
      "Common mistakes that many Redux devs make",
      "And much, much more!"
    ]
  },
  {
    "id": "05",
    "name": "The Ultimate TypeScript Course",
    "image": "https://i.ibb.co/4pLJ8rJ/convert.jpg",
    "title": "Learn to make your JavaScript applications scale",
    "price": 115,
    "rating": 4.9,
    "description": "TypeScript has never been so popular! It's an essential language for building large-scalable applications. That's why more and more companies are looking for developers who know TypeScript well. If you're a JavaScript developer and want to upgrade your skills for better job opportunities, you must have TypeScript on your resume. That's what this course is all about In under 5 hours, you'll learn everything you need to know to effectively use TypeScript in front-end and back-end development. You'll see how TypeScript boosts your productivity and helps you write more maintainable and robust code with fewer bugs. If you're looking for a comprehensive, well-organized, and step-by-step TypeScript course that takes you from zero to hero, you're in the right place. Enroll now to get started!",
    "features": [
      "Gain a solid understanding of the TypeScript language and tools",
      "Learn all about classes, interfaces, and object-oriented programming with TypeScript",
      "Use generics to build re-usable types",
      "Create custom complex types",
      "Inject code using decorators",
      "Use TypeScript in React projects",
      "Use TypeScript in Node/Express projects",
      "Understand and troubleshoot confusing TypeScript errors",
      "Write modular code using modules",
      "Integrate with third-party JavaScript libraries",
      "Debug TypeScript code",
      "Customize the TypeScript compiler (tsconfig)",
      "Apply best practices",
      "And much, much more!"
    ]
  },
  {
    "id": "06",
    "name": "The Complete Node.js Course",
    "image": "https://i.ibb.co/JCg3GKq/nodejs-1500x844.png",
    "title": "Learn to build highly-scalable, fast and secure RESTful APIs with Node, Express, and MongoDB.",
    "price": 170,
    "rating": 4.7,
    "description": "Want to learn Node.js, but are tired of wordy and slow instructors who talk to you like you've never coded before? Then I have the perfect course for you. A Node course that's finally different from the rest. A perfect mix of theory and practice with no waffling. Learn to build RESTful APIs with Node, Express and MongoDB with confidence. Includes best practices that pros apply, as well as going over common mistakes that many Node.js developers make. All in a single course using a real-world project.",
    "features": [
      "All about Node module system",
      "Use existing Node packages or publish your own",
      "Write asynchronous JavaScript code (promises and async/await)",
      "Implement CRUD operations",
      "Store complex, relational data in MongoDB using Mongoose",
      "Implement data validation",
      "Implement authentication and authorization",
      "Handle and log errors effectively",
      "Set up configuration for various environments (dev, test, prod)",
      "Write unit and integration tests",
      "Build features using test-driven development",
      "Deploy your Node apps to Heroku",
      "And much more!"
    ]
  }
]
